---
kind: enumMember
id: F:Autodesk.Revit.DB.LightingSource.ExteriorSun
enum: Autodesk.Revit.DB.LightingSource
source: html/fdac3194-8087-233a-0383-878f4716aea1.htm
---
# Autodesk.Revit.DB.LightingSource.ExteriorSun

Exterior source of light, sun only.